Config/Catalogs/уатМоделиТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатМоделиТС</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автотранспорт</Name>
					<Comment>Автотранспорт или оборудование (удалить?)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМоделиТС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыМоделейТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаДвери</Name>
					<Comment>(уэ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГабаритныйРазмерВысота</Name>
					<Comment>Высота (мм)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГабаритныйРазмерДлина</Name>
					<Comment>Длина (мм)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГабаритныйРазмерШирина</Name>
					<Comment>Ширина (мм)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоподъемность</Name>
					<Comment>Грузоподъемность, тонн</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеТопливо</Name>
					<Comment>Дополнительное топливо</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияАТСЕЭК</Name>
					<Comment>Категория по классификатору ЕЭК</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатКатегорииАТСЕЭКООН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиренс</Name>
					<Comment>(удалить?)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКолес</Name>
					<Comment>Количество колес</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоОсей</Name>
					<Comment>Количество осей</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяСкорость</Name>
					<Comment>Максимальная скорость</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельДвигателя</Name>
					<Comment>Модель двигателя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МощностьДвигателяКВТ</Name>
					<Comment>Мощность двигателя (квт)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МощностьДвигателяЛС</Name>
					<Comment>Мощность двигатель (лс)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеСпидометра</Name>
					<Comment>Признак наличия спидометра</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеТопливногоБака</Name>
					<Comment>Признак наличия топливного бака</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормируемаяЗагрузкаСамосвала</Name>
					<Comment>Нормируемая загрузка самосвала, %</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемБака</Name>
					<Comment>Объем бака (л)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемКузова</Name>
					<Comment>Объем кузова (м3)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеТопливо</Name>
					<Comment>Основное топливо</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолезныйРазмерВысота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолезныйРазмерДлина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолезныйРазмерШирина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийОбъемДвигателя</Name>
					<Comment>Рабочий объем двигателя, см3</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СидячихМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобственныйВес</Name>
					<Comment>Собственный вес, тонн</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПогрузки</Name>
					<Comment>(уэ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДвигателя</Name>
					<Comment>Тип двигателя</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатТипыДвигателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТС</Name>
					<Comment>Тип ТС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаДвери</Name>
					<Comment>(уэ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НормативыОбслуживания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОбслуживания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Допуск</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметраВыработки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПериодов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрВыработки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодичностьОбслуживания</Name>
							<Comment>(Упр)</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Плановый</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РаботаПоОбслуживанию</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/уатВидыМоделейТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыМоделейТС</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автотранспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прицеп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/уатМоделиТС/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//об = РеквизитФормыВЗначение("Объект");
	//уатЗащищенныеФункцииСервер.уатСправочникФормаЭлементаПриСозданииНаСервере(Об, Отказ, СтандартнаяОбработка, ЭтаФорма, ДопПараметрыОткрытие);
	//ЗначениеВРеквизитФормы(Об,"Объект");
	//Если Отказ тогда
	//	Возврат;
	//КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если Объект.Ссылка.Пустая() И НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Объект.ВидМоделиТС				= Перечисления.уатВидыМоделейТС.Автотранспорт;
		Объект.НаличиеТопливногоБака	= Истина;
		Объект.НаличиеСпидометра		= Истина;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(НормыРасходаГСМ.Отбор, "МодельТС", Объект.Ссылка,,,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(НормыРасходаТЖ.Отбор, "МодельТС", Объект.Ссылка,,,Истина);
	
	СпидометрСчетчикМЧ = ?(НЕ Объект.НаличиеСпидометра, 1, 0);
	
	//ЗагрузитьМакетТС();
	
	// Сохраним старое значение Вида модели ТС
	Если Параметры.Ключ.Пустая() Тогда 
		ВидМоделиТСДоИзменения = Перечисления.уатВидыМоделейТС.ПустаяСсылка();
	Иначе 
		ВидМоделиТСДоИзменения = Объект.ВидМоделиТС;
	КонецЕсли;
	
	Если НЕ ПравоДоступа("Редактирование", Метаданные.Справочники.уатМоделиТС) Тогда
		Элементы.СпидометрСчетчикМЧ.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//уатЗащищенныеФункцииКлиент.уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	//Если Отказ Тогда
	//	Возврат;
	//КонецЕсли;
	
	ПриИзмененииПризнакаСпидометра();
	
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(НормыРасходаГСМ.Отбор, "МодельТС", Объект.Ссылка,,,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(НормыРасходаТЖ.Отбор, "МодельТС", Объект.Ссылка,,,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НормыРасходаГСМПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	//уатОбщегоНазначенияКлиент.ПроверитьЗаписьНовогоОбъектаВФорме(ЭтаФорма, Объект.Ссылка,,, Отказ);
	//Если Отказ Тогда
	//	Возврат;
	//КонецЕсли;
		
	//Если НЕ Копирование Тогда
	//	Отказ = Истина;
	//	
	//	СтруктураОтбора = Новый Структура;
	//	СтруктураОтбора.Вставить("МодельТС"	, Объект.Ссылка);
	//	СтруктураОтбора.Вставить("ГСМ"		, Объект.ОсновноеТопливо);
	//	ОткрытьФорму("РегистрСведений.уатНормыРасходаГСМ.ФормаЗаписи", Новый Структура("ЗначенияЗаполнения", 
	//		СтруктураОтбора));
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НормыРасходаГСМПередНачаломИзменения(Элемент, Отказ)
	Если Модифицированность Тогда
		Ответ = Неопределено;
		Отказ = Истина;
		ПоказатьВопрос(Новый ОписаниеОповещения("НормыРасходаГСМПередНачаломИзмененияЗавершение", ЭтотОбъект), "Перед изменением норм расход ГСМ необходимо записать элемент. Продолжить?", РежимДиалогаВопрос.ОКОтмена);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеТопливоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДопПараметры = Новый Структура("ЗначениеГСМДоИзменения, ИмяПроцедурыОписаниеОповещения", Объект.ОсновноеТопливо, "ОписаниеОповещенияВыбораГСМ");
	//уатЗащищенныеФункцииКлиент.ВыбратьГСМ(ПредопределенноеЗначение("Перечисление.уатГруппыГСМ.Топливо"), ЭтаФорма, ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ДополнительноеТопливоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДопПараметры = Новый Структура("ЗначениеГСМДоИзменения, ИмяПроцедурыОписаниеОповещения", Объект.ДополнительноеТопливо, "ОписаниеОповещенияВыбораГСМДоп");
	//уатЗащищенныеФункцииКлиент.ВыбратьГСМ(ПредопределенноеЗначение("Перечисление.уатГруппыГСМ.Топливо"), ЭтаФорма, ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ТипДвигателяПриИзменении(Элемент)
	Если Объект.ВидМоделиТС = ПредопределенноеЗначение("Перечисление.уатВидыМоделейТС.Автотранспорт") И НЕ ЗначениеЗаполнено(Объект.ТипДвигателя) Тогда
		Объект.ОсновноеТопливо = Неопределено;
		Объект.ДополнительноеТопливо = Неопределено;
	КонецЕсли;
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ВидМоделиТСПриИзменении(Элемент)
	Если Объект.ВидМоделиТС = ПредопределенноеЗначение("Перечисление.уатВидыМоделейТС.Автотранспорт") И НЕ ЗначениеЗаполнено(Объект.ТипДвигателя) Тогда
		Объект.ОсновноеТопливо = Неопределено;
		Объект.ДополнительноеТопливо = Неопределено;
	КонецЕсли;
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура НаличиеТопливногоБакаПриИзменении(Элемент)
	УправлениеВидимостью();
	Если НЕ Объект.НаличиеТопливногоБака тогда
		Объект.ОбъемБака = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НормативыОбслуживанияВидОбслуживанияПриИзменении(Элемент)
	СтрокТабличнойЧасти = Элементы.НормативыОбслуживания.ТекущиеДанные;
	ПроверитьНаДублиТО(СтрокТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура НормативыОбслуживанияПараметрВыработкиПриИзменении(Элемент)
	СтрокТабличнойЧасти = Элементы.НормативыОбслуживания.ТекущиеДанные;
	ПроверитьНаДублиТО(СтрокТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура СпидометрСчетчикМЧПриИзменении(Элемент)
	Объект.НаличиеСпидометра = ?(СпидометрСчетчикМЧ = 0, Истина, Ложь);
	ПриИзмененииПризнакаСпидометра();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НормыРасходаТЖПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	#Если ВебКлиент Тогда
		Если НЕ Копирование Тогда
			Отказ = Истина;
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("МодельТС", Объект.Ссылка);
			ОткрытьФорму("РегистрСведений.уатНормыРасходаТехническихЖидкостей.ФормаЗаписи", Новый Структура("ЗначенияЗаполнения", СтруктураОтбора));
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура МакетТСПриИзменении(Элемент)
	Если НЕ ОтрисовываетсяМакет Тогда
		ЗагрузитьМакетТС();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств()
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтотОбъект, Объект.Ссылка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ПриИзмененииПризнакаСпидометра()
	Элементы.НормыРасходаГСМЛинейнаяНорма.Видимость						= Объект.НаличиеСпидометра;
	Элементы.НормыРасходаГСМНормаНаИзменениеСобственногоВеса.Видимость	= Объект.НаличиеСпидометра;
	Элементы.НормыРасходаГСМНормаНаТранспортнуюРаботу.Видимость			= Объект.НаличиеСпидометра;
	Элементы.НормыРасходаГСМНормаСпециальнаяНаМоточас.Видимость			= НЕ Объект.НаличиеСпидометра;
	Если Объект.НаличиеСпидометра Тогда
		мКолонка = Элементы.НормыРасходаГСМНормаНаПростойСВклДвигателем;
		мКолонка.Заголовок = "Норма пробега на 1 час простоя с вкл. двигателем, км";
		мКолонка.Подсказка = "Норма пробега на 1 час простоя с вкл. двигателем, км";
	Иначе
		мКолонка = Элементы.НормыРасходаГСМНормаНаПростойСВклДвигателем;
		мКолонка.Заголовок = "Норма на простой с вкл. двигателем, л/ч";
		мКолонка.Подсказка = "Норма на простой с вкл. двигателем, л/ч";
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостью()
	ЭтоАвтотранспорт = ?(Объект.ВидМоделиТС = ПредопределенноеЗначение("Перечисление.уатВидыМоделейТС.Автотранспорт"), 
		Истина, Ложь);
	ЭтоПрицеп		 = ?(Объект.ВидМоделиТС = ПредопределенноеЗначение("Перечисление.уатВидыМоделейТС.Прицеп"), Истина, Ложь);
	
	Если ЭтоАвтотранспорт Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ТипДвигателя) Тогда
			Элементы.МодельДвигателя.Доступность 		= Ложь;
			Элементы.ОсновноеТопливо.Доступность 		= Ложь;
			Элементы.ДополнительноеТопливо.Доступность	= Ложь;
		Иначе	
			Элементы.МодельДвигателя.Доступность 		= Истина;
			Элементы.ОсновноеТопливо.Доступность 		= Истина;
			Элементы.ДополнительноеТопливо.Доступность	= Истина;
		КонецЕсли;	
	Иначе	
		Элементы.МодельДвигателя.Доступность 			= Истина;
		Элементы.ОсновноеТопливо.Доступность 			= Истина;
		Элементы.ДополнительноеТопливо.Доступность		= Ложь;
	КонецЕсли;	
	
	Элементы.ТипТС.Видимость			= ЭтоАвтотранспорт ИЛИ ЭтоПрицеп;
	Элементы.КатегорияАТСЕЭК.Видимость	= ЭтоАвтотранспорт ИЛИ ЭтоПрицеп;
	Элементы.ОбъемБака.Видимость		= Объект.НаличиеТопливногоБака;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНаДублиТО(СтрокаТабличнойЧасти)
	//мВидТО				=  СтрокаТабличнойЧасти.ВидОбслуживания;
	//мПараметрВыработки	=  СтрокаТабличнойЧасти.ПараметрВыработки;
	//
	//к = 0;
	//Для Каждого СтрокаТЧ Из Объект.НормативыОбслуживания Цикл
	//	Если (мВидТО = СтрокаТч.ВидОбслуживания) И (мПараметрВыработки = СтрокаТч.ПараметрВыработки)  Тогда
	//		к = к + 1;
	//	КонецЕсли;
	//КонецЦикла;
	//Если к > 1 Тогда
	//	Сообщить("Нельзя вводить две строки с одинаковым видом ТО");
	//	СтрокаТабличнойЧасти.ВидОбслуживания = ПредопределенноеЗначение("Справочник.уатВидыОбслуживанияТС.ПустаяСсылка"); 
//	Иначе
//		СтрокаТабличнойЧасти.Плановый = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(
//			СтрокаТабличнойЧасти.ВидОбслуживания, "ИспользоватьВПланированииТО")
//	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НормыРасходаГСМПередНачаломИзмененияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		Попытка
			Записать();
		Исключение
			Возврат;
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

// Подключаемый динамически обработчик оповещения
&НаКлиенте
Процедура ОписаниеОповещенияВыбораГСМ(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ОсновноеТопливо = Результат;
	
	Если Объект.ОсновноеТопливо <> ДопПараметры.ЗначениеГСМДоИзменения Тогда 
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

// Подключаемый динамически обработчик оповещения
&НаКлиенте
Процедура ОписаниеОповещенияВыбораГСМДоп(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ДополнительноеТопливо = Результат;
	
	Если Объект.ДополнительноеТопливо <> ДопПараметры.ЗначениеГСМДоИзменения Тогда 
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтрисоватьШину(СтрокаШины, МакетВывода)
	ОтрисовываетсяМакет = Истина;
	
	НоваяКартинка = МакетВывода.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
	НоваяКартинка.Лево = СтрокаШины.Строки.Найти("Кордината X").Значение;
	НоваяКартинка.Верх = СтрокаШины.Строки.Найти("Кордината Y").Значение;
	НоваяКартинка.Ширина = СтрокаШины.Строки.Найти("Ширина").Значение;
	НоваяКартинка.Высота = СтрокаШины.Строки.Найти("Высота").Значение;
	НоваяКартинка.РазмерКартинки = РазмерКартинки.Пропорционально;
	НоваяКартинка.ЦветЛинии = ЦветаСтиля.ЦветРамки;
	НоваяКартинка.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, 2);
	НоваяКартинка.ЦветФона = ЦветаСтиля.ЦветФонаФормы;
	
	ОтрисовываетсяМакет = Ложь;
КонецПроцедуры

&НаСервере
Процедура ОтрисоватьКорпус(СтрокаКорпус, Макет, МакетВывода)
	ОтрисовываетсяМакет = Истина;
	
	НоваяКартинка = МакетВывода.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
	НоваяКартинка.Лево = СтрокаКорпус.Строки.Найти("Кордината X").Значение;
	НоваяКартинка.Верх = СтрокаКорпус.Строки.Найти("Кордината Y").Значение;
	НоваяКартинка.Ширина = СтрокаКорпус.Строки.Найти("Ширина").Значение;
	НоваяКартинка.Высота = СтрокаКорпус.Строки.Найти("Высота").Значение;
	НоваяКартинка.РазмерКартинки = РазмерКартинки.Пропорционально;
	НоваяКартинка.ГраницаСлева = Ложь;
	НоваяКартинка.ГраницаСправа = Ложь;
	НоваяКартинка.ГраницаСверху = Ложь;
	НоваяКартинка.ГраницаСнизу = Ложь;
	
	Если Макет.ХранитьМакетВоВнешнемФайле Тогда
		Попытка
			ПолноеИмяФайла = СтрокаКорпус.Строки.Найти("Путь").Значение;
			ФайлНаДиске = Новый Файл(ПолноеИмяФайла);
			Если ФайлНаДиске.Существует() Тогда
				НоваяКартинка.Картинка = Новый Картинка(ПолноеИмяФайла);   			  
			КонецЕсли;
		Исключение
			Сообщить("Ошибка открытия файла картинки: " + ИнформацияОбОшибке().Описание + " по причине " + ИнформацияОбОшибке().Причина, СтатусСообщения.Внимание)
		КонецПопытки;
	Иначе
		Попытка
			НоваяКартинка.Картинка = Макет.ХранилищеМакета.Получить();
		Исключение
			Сообщить("Ошибка отображения картинки: " + ИнформацияОбОшибке().Описание + " по причине " + ИнформацияОбОшибке().Причина, СтатусСообщения.Внимание)
		КонецПопытки;
	КонецЕсли;
	
	ОтрисовываетсяМакет = Ложь;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьМакетТС()
	ДопМакет = Справочники.уатМакетыТС.ПолучитьМакет("Макет");
	
	Если ЗначениеЗаполнено(Объект.МакетТС) Тогда
		КешНастройкаРисункаТС = Объект.МакетТС.ДеревоМакета.Получить();
		Если КешНастройкаРисункаТС = Неопределено Тогда
			Возврат; 
		КонецЕсли;
		
		Корпус = КешНастройкаРисункаТС.Строки.Найти("КорпусАвто");
		ОтрисоватьКорпус(Корпус, Объект.МакетТС, ДопМакет);
		
		КШины  = КешНастройкаРисункаТС.Строки.Найти("Шины");
		Для Каждого Шина Из КШины.Строки Цикл
			Если Шина.Строки.Найти("Установлено").Значение Тогда
				ОтрисоватьШину(Шина, ДопМакет);
			КонецЕсли;
		КонецЦикла; 
	Иначе
	КонецЕсли;
	
	ТабДок = ДопМакет;
КонецПроцедуры

#КонецОбласти
